In [300]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from collections import OrderedDict

In [301]:
# Order is not maintained when using just dictionary
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
         'Jan': [150, 200, 50],
         'Feb': [200, 210, 90],
         'Mar': [140, 215, 95]}
df = DataFrame.from_dict(sales)
df

   Feb  Jan  Mar    account
0  200  150  140  Jones LLC
1  210  200  215   Alpha Co
2   90   50   95   Blue Inc

In [302]:
# Manually reordering columns
df = df[['account', 'Jan', 'Feb', 'Mar']]
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [303]:
# Using ordered Dictionary
sales = OrderedDict([ ('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
          ('Jan', [150, 200, 50]),
          ('Feb',  [200, 210, 90]),
          ('Mar', [140, 215, 95]) ] )
df = pd.DataFrame.from_dict(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [304]:
# Dataframe using Lists
sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

In [305]:
# Renaming columns
df.columns = [i.lower() for i in df.columns]
df

     account  jan  feb  mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

In [306]:
# Renaming a specific column
df.rename(columns = {'account':'account_name'},inplace=True)
df

  account_name  jan  feb  mar
0    Jones LLC  150  200   50
1     Alpha Co  200  210   90
2     Blue Inc  140  215   95

In [307]:
type(df.columns)

pandas.core.indexes.base.Index

In [308]:
df['account_name']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account_name, dtype: object

In [309]:
type(df['account_name'])

pandas.core.series.Series

In [310]:
df['account_name'][0]

'Jones LLC'

In [311]:
type(df['account_name'][0])

str

In [312]:
df = DataFrame(df,columns=['account_name','jan','feb','mar','apr'])
df

  account_name  jan  feb  mar  apr
0    Jones LLC  150  200   50  NaN
1     Alpha Co  200  210   90  NaN
2     Blue Inc  140  215   95  NaN

In [313]:
df.loc[2]

account_name    Blue Inc
jan                  140
feb                  215
mar                   95
apr                  NaN
Name: 2, dtype: object

In [314]:
t = Series(range(50,53))
t

0    50
1    51
2    52
dtype: int64

In [315]:
df['apr'] = t
df

  account_name  jan  feb  mar  apr
0    Jones LLC  150  200   50   50
1     Alpha Co  200  210   90   51
2     Blue Inc  140  215   95   52

In [316]:
#Chaining Conditions - Using Bitwise Operators
df[(df['jan'] == 150) | (df['feb'] == 215)]

  account_name  jan  feb  mar  apr
0    Jones LLC  150  200   50   50
2     Blue Inc  140  215   95   52

In [317]:
# Changing Values in a Column
# Suppose I wish to add 30 to each value in april
df['apr'] = df['apr'].apply(lambda x: x+30)
df

  account_name  jan  feb  mar  apr
0    Jones LLC  150  200   50   80
1     Alpha Co  200  210   90   81
2     Blue Inc  140  215   95   82

In [318]:
# Adding a blank column
df.insert(loc=4, column='may', value='')
df

  account_name  jan  feb  mar may  apr
0    Jones LLC  150  200   50       80
1     Alpha Co  200  210   90       81
2     Blue Inc  140  215   95       82

In [319]:
df = df[['account_name','jan','feb','mar','apr','may']]
df

  account_name  jan  feb  mar  apr may
0    Jones LLC  150  200   50   80
1     Alpha Co  200  210   90   81
2     Blue Inc  140  215   95   82

In [320]:
# Applying Functions to Multiple Columns
# Adding 10 to jan and feb values
df[['jan','feb']] = df[['jan','feb']].applymap(lambda x:x+10)
df

  account_name  jan  feb  mar  apr may
0    Jones LLC  160  210   50   80
1     Alpha Co  210  220   90   81
2     Blue Inc  150  225   95   82

In [321]:
df['may']=np.nan
df

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80  NaN
1     Alpha Co  210  220   90   81  NaN
2     Blue Inc  150  225   95   82  NaN

In [322]:
# Counting Rows with NaNs
nans = df.shape[0] - df.dropna().shape[0]
print('%d rows have missing values' % nans)

3 rows have missing values

In [323]:
df['may'] = np.arange(3)
df

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80    0
1     Alpha Co  210  220   90   81    1
2     Blue Inc  150  225   95   82    2

In [324]:
df['june']=np.nan
df

  account_name  jan  feb  mar  apr  may  june
0    Jones LLC  160  210   50   80    0   NaN
1     Alpha Co  210  220   90   81    1   NaN
2     Blue Inc  150  225   95   82    2   NaN

In [325]:
del df['june']
df

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80    0
1     Alpha Co  210  220   90   81    1
2     Blue Inc  150  225   95   82    2

In [326]:
# To delete a column -
df.drop(2)

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80    0
1     Alpha Co  210  220   90   81    1

In [327]:
#To delete a column
df.drop('may',axis = 1)

  account_name  jan  feb  mar  apr
0    Jones LLC  160  210   50   80
1     Alpha Co  210  220   90   81
2     Blue Inc  150  225   95   82

In [328]:
df.sort_index()

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80    0
1     Alpha Co  210  220   90   81    1
2     Blue Inc  150  225   95   82    2

In [329]:
df.sort_values('jan',ascending=False)

  account_name  jan  feb  mar  apr  may
1     Alpha Co  210  220   90   81    1
0    Jones LLC  160  210   50   80    0
2     Blue Inc  150  225   95   82    2

In [341]:
# Statistics Summary
print df.describe().loc['min','feb']
print df.describe()
print "Min of jan month = ",df['jan'].min()
print "Id of min jan month = ",df['jan'].idxmin()
print "Min of all columns = \n",df.min()

210.0
              jan         feb        mar   apr         may  june
count    3.000000    3.000000   3.000000   3.0    3.000000   3.0
mean   173.333333  218.333333  78.333333  81.0   67.666667   0.0
std     32.145503    7.637626  24.664414   1.0  114.605119   0.0
min    150.000000  210.000000  50.000000  80.0    1.000000   0.0
25%    155.000000  215.000000  70.000000  80.5    1.500000   0.0
50%    160.000000  220.000000  90.000000  81.0    2.000000   0.0
75%    185.000000  222.500000  92.500000  81.5  101.000000   0.0
max    210.000000  225.000000  95.000000  82.0  200.000000   0.0
Min of jan month =  150.0
Id of min jan month =  2
Min of all columns =
account_name           inf
jan             150.000000
feb             210.000000
mar              50.000000
apr              80.000000
may               1.000000
june              0.000000
dtype: float64

In [331]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
account_name    3 non-null object
jan             3 non-null int64
feb             3 non-null int64
mar             3 non-null int64
apr             3 non-null int64
may             3 non-null int64
dtypes: int64(5), object(1)
memory usage: 216.0+ bytes

In [332]:
df

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80    0
1     Alpha Co  210  220   90   81    1
2     Blue Inc  150  225   95   82    2

In [333]:
# To replace a value in may and 0th row from 0 to 200
row = 0
col = 'may'
df.set_value(row,col,200)
df

  account_name  jan  feb  mar  apr  may
0    Jones LLC  160  210   50   80  200
1     Alpha Co  210  220   90   81    1
2     Blue Inc  150  225   95   82    2

In [334]:
df['june'] = np.nan
df

  account_name  jan  feb  mar  apr  may  june
0    Jones LLC  160  210   50   80  200   NaN
1     Alpha Co  210  220   90   81    1   NaN
2     Blue Inc  150  225   95   82    2   NaN

In [335]:
# Selecting NaN Rows
df[df['june'].isnull()]

  account_name  jan  feb  mar  apr  may  june
0    Jones LLC  160  210   50   80  200   NaN
1     Alpha Co  210  220   90   81    1   NaN
2     Blue Inc  150  225   95   82    2   NaN

In [336]:
# Not Selecting NaN Rows
df[df['june'].notnull()]

Empty DataFrame
Columns: [account_name, jan, feb, mar, apr, may, june]
Index: []

In [337]:
# FIlling nan rows 
df.fillna(value=0, inplace=True)
df

  account_name  jan  feb  mar  apr  may  june
0    Jones LLC  160  210   50   80  200   0.0
1     Alpha Co  210  220   90   81    1   0.0
2     Blue Inc  150  225   95   82    2   0.0

In [338]:
new_row = Series([np.nan]*len(df.columns),index=df.columns)
new_row

account_name   NaN
jan            NaN
feb            NaN
mar            NaN
apr            NaN
may            NaN
june           NaN
dtype: float64

In [339]:
df = df.append(new_row,ignore_index=True)
df

  account_name    jan    feb   mar   apr    may  june
0    Jones LLC  160.0  210.0  50.0  80.0  200.0   0.0
1     Alpha Co  210.0  220.0  90.0  81.0    1.0   0.0
2     Blue Inc  150.0  225.0  95.0  82.0    2.0   0.0
3          NaN    NaN    NaN   NaN   NaN    NaN   NaN

In [342]:
df1 = pd.DataFrame({'data1' : np.random.randn(5),'data2' : np.random.randn(5)})
df1.assign(ratio = df1['data1'] / df1['data2'])

      data1     data2       ratio
0 -0.582684 -0.005665  102.854686
1  0.007255 -0.329420   -0.022025
2  0.209203  0.834271    0.250762
3 -0.079267 -1.386844    0.057156
4  0.909476 -0.425251   -2.138681

In [344]:
df2 = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'data1' : np.arange(10,15),
                   'data2' : np.arange(30,35)})
df2

   data1  data2 key1
0     10     30    a
1     11     31    a
2     12     32    b
3     13     33    b
4     14     34    a

In [349]:
grouped = df2['data1'].groupby(df2['key1'])
grouped.mean()

key1
a    11.666667
b    12.500000
Name: data1, dtype: float64

In [350]:
df.filter(like='data')

   data1  data2
0     10     30
1     11     31
2     12     32
3     13     33
4     14     34

In [351]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [352]:
data.group.value_counts()

b    3
c    3
a    3
Name: group, dtype: int64